import {AxiosPromise} from "axios";

export type IRes<T> = Promise<AxiosPromise<T>>

// У коді оголошено тип IRes<T>, який складається з generic-типу T.
// Цей тип означає, що результатом будь-якої функції або методу, який повертає змінну типу IRes<T>,
// буде Promise, який, в свою чергу, повертає змінну типу AxiosPromise<T>.
// AxiosPromise<T> - це тип даних, який повертає бібліотека Axios при виконанні HTTP-запиту до віддаленого серверу.
// Він містить інформацію про стан запиту (наприклад, чи успішно виконаний запит, чи не було помилок),
// а також про дані, отримані від сервера.
// Отже, тип IRes<T> використовується, коли необхідно описати результат виконання функції або методу,
// який повертає результат з типом AxiosPromise<T> у вигляді Promise. Наприклад,
// такий тип може використовуватися при визначенні типу поверненого значення з функції,
// яка виконує HTTP-запит за допомогою Axios.