import {Dispatch, SetStateAction} from "react";

export type ISetState<T> = Dispatch<SetStateAction<T>>

//В вашому коді оголошено тип ISetState<T>,
// який є generic-типом і використовується для опису типу функції setState компонента React.

// Тип Dispatch<A> є типом даних, який використовується для передачі функції-диспетчера (dispatcher function),
// яка забезпечує зміну стану (state) компонента React. Для цього, функція-диспетчер приймає параметр A,
// який вказує на новий стан компонента.

// Тип SetStateAction<T> є типом даних, який представляє новий стан компонента,
// який буде використовуватися для оновлення поточного стану. Цей тип може бути будь-яким типом даних,
// включаючи примітивні типи, об'єкти або масиви.

// Тип ISetState<T> описує тип функції setState для компонента React з generic-параметром T,
// який відповідає за тип нового стану компонента. Це дозволяє типізувати функції компонентів,
// які використовують setState для зміни стану, забезпечуючи статичний аналіз коду та
// запобігаючи помилкам під час виконання.

// Отже, тип ISetState<T> використовується для опису типу функції setState компонента React з generic-параметром T,
// яка приймає новий стан компонента типу T. Використання цього типу дозволяє підвищити надійність та
// зручність розробки, зменшуючи кількість помилок та спрощуючи роботу зі станом компонентів.